/*
 * @Author: your name
 * @Date: 2020-08-10 14:57:03
 * @LastEditTime: 2020-08-10 15:41:10
 * @LastEditors: Please set LastEditors
 * @Description: In User Settings Edit
 * @FilePath: \FM32_NB温湿度\BSP\Inc\rtc.h
 */
#ifndef _RTC_H_
#define _RTC_H_
/* Includes ------------------------------------------------------------------*/
#include "main.h"
/* 函数原型 ----------------------------------------------------------*/
/* 宏  ---------------------------------------------------------------*/
/* 变量 --------------------------------------------------------------*/
/* 类型定义 ----------------------------------------------------------*/
/* 函数声明 ----------------------------------------------------------*/
/* 函数代码 ----------------------------------------------------------*/

//void rtc_show_alarm_time(void);

void rtc_set_alarm(uint8_t sec);
void RTC_Init(void);
void SET_RTCA_Alarm(void);
#endif
